---
kind: enumMember
id: F:Autodesk.Revit.DB.DataExchangeMessageId.ObjectNotConverted
enum: Autodesk.Revit.DB.DataExchangeMessageId
source: html/f8f4737f-8c74-7c67-4669-ddddd2ccde1d.htm
---
# Autodesk.Revit.DB.DataExchangeMessageId.ObjectNotConverted

An error message. The conversion code was unable to process a valid supported source object.